-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ECON108\Lab4\econ108_32_lab4.log
  log type:  text
 opened on:  13 May 2022, 14:39:13

. use "lab3_data", replace

. 
. 
. *A OLS
. reg violentrate uerate, robust

Linear regression                               Number of obs     =      1,938
                                                F(1, 1936)        =      62.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     292.76

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |   26.17347   3.318877     7.89   0.000     19.66452    32.68242
       _cons |   306.8934   18.77873    16.34   0.000     270.0647    343.7221
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel replace cttop (OLS)
econ108_32_lab4.xml
dir : seeout

. 
. *B  Dummy Variable Fixed Effects
. reg violentrate uerate i.fips, robust

Linear regression                               Number of obs     =      1,938
                                                F(51, 1886)       =     220.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8354
                                                Root MSE          =     122.44

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.91749   1.387807    -7.87   0.000    -13.63929   -8.195695
             |
        fips |
          2  |   103.1677   23.92511     4.31   0.000     56.24522    150.0902
          4  |   39.38451   23.94573     1.64   0.100    -7.578389    86.34741
          5  |  -62.56061   24.32879    -2.57   0.010    -110.2748   -14.84644
          6  |   229.6464   39.26738     5.85   0.000     152.6343    306.6584
          8  |  -97.92954   24.69041    -3.97   0.000    -146.3529   -49.50615
          9  |  -157.7596   23.98477    -6.58   0.000    -204.7991   -110.7202
         10  |   55.61623   27.07513     2.05   0.040     2.515868    108.7166
         11  |   1298.082   80.78428    16.07   0.000     1139.646    1456.518
         12  |    346.031    39.7568     8.70   0.000      268.059    424.0029
         13  |   12.60707   26.30952     0.48   0.632    -38.99176     64.2059
         15  |   -274.526   20.74806   -13.23   0.000    -315.2176   -233.8344
         16  |  -268.9514   20.72997   -12.97   0.000    -309.6075   -228.2953
         17  |   197.0379   34.75016     5.67   0.000     128.8851    265.1907
         18  |  -143.9043   22.96469    -6.27   0.000    -188.9432   -98.86543
         19  |  -281.9169   21.91548   -12.86   0.000     -324.898   -238.9357
         20  |   -148.155   22.13717    -6.69   0.000    -191.5709   -104.7391
         21  |  -207.8223   23.37478    -8.89   0.000    -253.6654   -161.9791
         22  |   207.4306   31.60063     6.56   0.000     145.4547    269.4064
         23  |  -381.7825   21.48587   -17.77   0.000     -423.921   -339.6439
         24  |   238.8372   30.63986     7.79   0.000     178.7456    298.9288
         25  |   24.80342   27.43989     0.90   0.366    -29.01231    78.61915
         26  |   126.9183    27.6933     4.58   0.000     72.60556     181.231
         27  |  -265.0824   21.58561   -12.28   0.000    -307.4166   -222.7482
         28  |  -171.0067   22.26836    -7.68   0.000    -214.6799   -127.3335
         29  |   25.02462   24.83061     1.01   0.314    -23.67374    73.72298
         30  |  -289.5137    23.0491   -12.56   0.000    -334.7181   -244.3092
         31  |  -255.0303   23.44533   -10.88   0.000    -301.0118   -209.0488
         32  |   194.1299   27.37963     7.09   0.000     140.4323    247.8274
         33  |  -396.7934   21.36637   -18.57   0.000    -438.6976   -354.8892
         34  |  -49.67292   28.21837    -1.76   0.079    -105.0154    5.669574
         35  |   192.7563   27.56103     6.99   0.000      138.703    246.8097
         36  |   237.8799   49.79579     4.78   0.000     140.2193    335.5406
         37  |  -36.80473   24.42447    -1.51   0.132    -84.70655    11.09709
         38  |  -439.3929   23.33559   -18.83   0.000    -485.1592   -393.6266
         39  |   -111.192   23.48124    -4.74   0.000     -157.244   -65.14009
         40  |  -44.74472   24.54727    -1.82   0.068    -92.88738    3.397932
         41  |  -93.75068   26.93673    -3.48   0.001    -146.5796   -40.92176
         42  |  -131.7304   21.10072    -6.24   0.000    -173.1136   -90.34724
         44  |  -189.5541   22.90623    -8.28   0.000    -234.4783   -144.6299
         45  |   248.4839   29.94429     8.30   0.000     189.7565    307.2113
         46  |  -364.0905   22.70069   -16.04   0.000    -408.6116   -319.5694
         47  |   98.52479   28.99064     3.40   0.001     41.66771    155.3819
         48  |    43.0203   27.86419     1.54   0.123    -11.62757    97.66818
         49  |  -274.1866   21.22269   -12.92   0.000     -315.809   -232.5641
         50  |  -406.3391    20.9517   -19.39   0.000    -447.4301   -365.2482
         51  |  -240.0868   21.85215   -10.99   0.000    -282.9437   -197.2298
         53  |  -107.0396   22.93275    -4.67   0.000    -152.0158   -62.06338
         54  |  -274.3138   21.73219   -12.62   0.000    -316.9355   -231.6922
         55  |  -294.1834   21.52145   -13.67   0.000    -336.3918    -251.975
         56  |  -267.7699    21.9924   -12.18   0.000    -310.9019   -224.6379
             |
       _cons |   589.4666   22.81788    25.83   0.000     544.7157    634.2176
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, N) cttop(DV)
econ108_32_lab4.xml
dir : seeout

. 
. reg violentrate uerate i.year, robust

Linear regression                               Number of obs     =      1,938
                                                F(38, 1899)       =       5.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1407
                                                Root MSE          =     278.79

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |   56.51998   4.998133    11.31   0.000     46.71757    66.32239
             |
        year |
       1977  |   37.26485    40.3609     0.92   0.356    -41.89151    116.4212
       1978  |   108.8804    41.7453     2.61   0.009     27.00898    190.7519
       1979  |   161.3201   45.52883     3.54   0.000     72.02828    250.6118
       1980  |   117.8009   52.44392     2.25   0.025     14.94711    220.6546
       1981  |   93.82526   55.25508     1.70   0.090    -14.54179    202.1923
       1982  |  -32.81283    54.5602    -0.60   0.548    -139.8171     74.1914
       1983  |  -60.05079   50.86943    -1.18   0.238    -159.8166    39.71504
       1984  |   43.75781   48.53619     0.90   0.367    -51.43205    138.9477
       1985  |   69.21263   48.48762     1.43   0.154    -25.88198    164.3072
       1986  |   104.5003   49.77281     2.10   0.036     6.885173    202.1154
       1987  |   135.9496   50.56975     2.69   0.007     36.77152    235.1277
       1988  |   204.6007   54.30982     3.77   0.000      98.0875    311.1139
       1989  |    243.616   56.49042     4.31   0.000     132.8262    354.4058
       1990  |   282.6364   61.16314     4.62   0.000     162.6824    402.5904
       1991  |   247.6226   60.29655     4.11   0.000     129.3681     365.877
       1992  |   237.3089   63.46826     3.74   0.000     112.8341    361.7838
       1993  |   276.1701   64.83331     4.26   0.000     149.0181    403.3221
       1994  |   294.2051   61.25481     4.80   0.000     174.0713    414.3389
       1995  |   302.3862   60.93491     4.96   0.000     182.8798    421.8926
       1996  |   271.3558   57.50543     4.72   0.000     158.5754    384.1363
       1997  |   276.1425    52.5171     5.26   0.000     173.1453    379.1398
       1998  |   262.2582   48.56932     5.40   0.000     167.0034    357.5131
       1999  |   243.1301   47.17556     5.15   0.000     150.6088    335.6515
       2000  |   240.3727   45.20122     5.32   0.000     151.7235     329.022
       2001  |    205.426   45.04334     4.56   0.000     117.0864    293.7656
       2002  |   152.9634   44.55023     3.43   0.001     65.59088     240.336
       2003  |    129.595    43.5848     2.97   0.003     44.11583    215.0741
       2004  |   139.0955   40.71239     3.42   0.001     59.24979    218.9412
       2005  |   159.7689   41.62581     3.84   0.000     78.13178     241.406
       2006  |   209.4383   43.93045     4.77   0.000     123.2813    295.5953
       2007  |   208.6654   43.41832     4.81   0.000     123.5128    293.8181
       2008  |   142.9604   41.50058     3.44   0.001     61.56892     224.352
       2009  |  -55.63755   41.38211    -1.34   0.179    -136.7967    25.52162
       2010  |  -91.96444   40.75098    -2.26   0.024    -171.8858   -12.04305
       2011  |  -72.57112   37.83706    -1.92   0.055    -146.7777    1.635457
       2012  |  -25.77388   37.52173    -0.69   0.492    -99.36202    47.81426
       2013  |   5.926426   37.29547     0.16   0.874    -67.21798    79.07083
             |
       _cons |  -17.91455    43.8828    -0.41   0.683    -103.9781    68.14902
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, N, Year FE, Y) cttop(DV)
econ108_32_lab4.xml
dir : seeout

. 
. reg violentrate uerate i.fips i.year, robust

Linear regression                               Number of obs     =      1,938
                                                F(88, 1849)       =     145.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8855
                                                Root MSE          =     103.13

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.03513   2.077279    -4.83   0.000    -14.10918   -5.961068
             |
        fips |
          2  |   102.5407   17.33881     5.91   0.000     68.53504    136.5465
          4  |   40.23205   12.61186     3.19   0.001     15.49707    64.96703
          5  |  -61.99869   17.41258    -3.56   0.000    -96.14906   -27.84831
          6  |   229.5512   26.90906     8.53   0.000     176.7758    282.3265
          8  |  -96.35986   16.08163    -5.99   0.000    -127.8999   -64.81979
          9  |  -156.1458   13.19508   -11.83   0.000    -182.0246    -130.267
         10  |   57.25325   21.69493     2.64   0.008     14.70411    99.80239
         11  |   1297.725    69.2728    18.73   0.000     1161.864    1433.586
         12  |   346.9249   27.19183    12.76   0.000      293.595    400.2548
         13  |   13.72396   14.06599     0.98   0.329    -13.86292    41.31084
         15  |  -272.5244   16.56189   -16.45   0.000    -305.0064   -240.0424
         16  |  -267.9251   14.16611   -18.91   0.000    -295.7083   -240.1418
         17  |   197.3026   21.77828     9.06   0.000       154.59    240.0152
         18  |  -143.0498   12.91077   -11.08   0.000     -168.371   -117.7286
         19  |  -279.5925   16.40216   -17.05   0.000    -311.7612   -247.4238
         20  |  -145.8446   15.10057    -9.66   0.000    -175.4606   -116.2287
         21  |  -207.4415   12.38786   -16.75   0.000    -231.7371   -183.1458
         22  |   207.3354   18.41186    11.26   0.000     171.2251    243.4456
         23  |  -380.6098   17.68234   -21.52   0.000    -415.2893   -345.9304
         24  |   240.5857   18.22421    13.20   0.000     204.8435    276.3279
         25  |   26.30344   14.24529     1.85   0.065    -1.635094    54.24198
         26  |   126.1288   17.49771     7.21   0.000     91.81145    160.4461
         27  |  -263.0089   14.36488   -18.31   0.000    -291.1819   -234.8358
         28  |  -171.3318   12.94008   -13.24   0.000    -196.7105   -145.9531
         29  |   26.13222   12.80332     2.04   0.041     1.021741    51.24271
         30  |  -288.2807   23.40743   -12.32   0.000    -334.1884   -242.3729
         31  |  -251.6959   18.03148   -13.96   0.000    -287.0601   -216.3317
         32  |    194.787   20.08727     9.70   0.000     155.3909    234.1831
         33  |  -394.2183   18.94537   -20.81   0.000    -431.3749   -357.0617
         34  |   -48.8486   16.35471    -2.99   0.003    -80.92424   -16.77297
         35  |   193.2463    16.8041    11.50   0.000     160.2893    226.2033
         36  |   238.4535    40.2905     5.92   0.000     159.4338    317.4731
         37  |   -35.5044   13.05575    -2.72   0.007    -61.10995   -9.898845
         38  |  -436.4184   22.08929   -19.76   0.000     -479.741   -393.0958
         39  |  -110.7973   13.23288    -8.37   0.000    -136.7502   -84.84434
         40  |  -42.88711   15.58994    -2.75   0.006    -73.46285   -12.31137
         41  |  -93.72978   17.98306    -5.21   0.000     -128.999   -58.46055
         42  |   -131.071   14.32666    -9.15   0.000    -159.1691   -102.9729
         44  |  -188.8947    13.7192   -13.77   0.000    -215.8014   -161.9879
         45  |   249.0714   19.37992    12.85   0.000     211.0625    287.0802
         46  |  -360.9209   20.83168   -17.33   0.000     -401.777   -320.0648
         47  |   99.21211   23.91685     4.15   0.000     52.30525     146.119
         48  |    44.0536    15.4826     2.85   0.004     13.68838    74.41883
         49  |  -272.1293   14.45363   -18.83   0.000    -300.4764   -243.7821
         50  |  -404.1123   17.78579   -22.72   0.000    -438.9947     -369.23
         51  |  -237.8344   13.60552   -17.48   0.000    -264.5182   -211.1506
         53  |  -106.9003   12.28278    -8.70   0.000    -130.9899   -82.81071
         54  |  -275.2218    19.2248   -14.32   0.000    -312.9263   -237.5172
         55  |  -292.7112   16.57109   -17.66   0.000    -325.2113   -260.2112
         56  |  -265.6755   15.39148   -17.26   0.000     -295.862    -235.489
             |
        year |
       1977  |     4.1178   17.46864     0.24   0.814    -30.14253    38.37813
       1978  |   14.00679   17.52539     0.80   0.424    -20.36484    48.37842
       1979  |   55.35388   16.55561     3.34   0.001     22.88422    87.82354
       1980  |   98.61733   17.91379     5.51   0.000     63.48395    133.7507
       1981  |   107.6583   20.05473     5.37   0.000     68.32598    146.9906
       1982  |   107.8664    17.7935     6.06   0.000     72.96893    142.7639
       1983  |   76.45244   16.45896     4.65   0.000     44.17234    108.7325
       1984  |   56.93833   15.31538     3.72   0.000     26.90106    86.97559
       1985  |   66.34162   15.51448     4.28   0.000     35.91389    96.76936
       1986  |   93.66879   17.63449     5.31   0.000     59.08319    128.2544
       1987  |   75.13653   16.74906     4.49   0.000     42.28747    107.9856
       1988  |     94.589   17.13793     5.52   0.000     60.97728    128.2007
       1989  |   112.0718   18.58901     6.03   0.000     75.61409    148.5294
       1990  |   171.3197   22.52865     7.60   0.000     127.1354     215.504
       1991  |   205.0795   22.78004     9.00   0.000     160.4022    249.7568
       1992  |   220.6049   27.16948     8.12   0.000     167.3188     273.891
       1993  |   222.2735   27.84156     7.98   0.000     167.6693    276.8777
       1994  |   195.6774   23.60904     8.29   0.000     149.3742    241.9806
       1995  |    178.672   23.95584     7.46   0.000     131.6886    225.6553
       1996  |   140.9861   20.85858     6.76   0.000     100.0772    181.8949
       1997  |   118.1068   16.69917     7.07   0.000     85.35557     150.858
       1998  |   81.38493   16.27022     5.00   0.000       49.475    113.2949
       1999  |   44.76982   16.57276     2.70   0.007     12.26654     77.2731
       2000  |   27.52688   17.12442     1.61   0.108    -6.058355    61.11212
       2001  |   33.94871   16.13391     2.10   0.035      2.30612    65.59131
       2002  |   36.42673   15.55238     2.34   0.019     5.924664     66.9288
       2003  |   28.84879   16.12666     1.79   0.074    -2.779588    60.47717
       2004  |   13.68479   18.15884     0.75   0.451    -21.92919    49.29877
       2005  |   15.17467   18.45894     0.82   0.411     -21.0279    51.37723
       2006  |   32.87152   18.89404     1.74   0.082    -4.184385    69.92742
       2007  |   26.61764   19.84653     1.34   0.180    -12.30631     65.5416
       2008  |   26.55425    19.1205     1.39   0.165    -10.94579    64.05429
       2009  |   36.75661   20.09531     1.83   0.068    -2.655283     76.1685
       2010  |   18.17774   20.76256     0.88   0.381     -22.5428    58.89827
       2011  |  -2.231504   21.75175    -0.10   0.918    -44.89207    40.42906
       2012  |  -8.286849    22.0603    -0.38   0.707    -51.55257    34.97888
       2013  |  -16.78061    22.0609    -0.76   0.447     -60.0475    26.48627
             |
       _cons |    509.001   23.58685    21.58   0.000     462.7414    555.2607
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, Y) cttop(DV)
econ108_32_lab4.xml
dir : seeout

. 
. *C xi
. xi : reg violentrate uerate i.fips i.year, robust
i.fips            _Ifips_1-56         (naturally coded; _Ifips_1 omitted)
i.year            _Iyear_1976-2013    (naturally coded; _Iyear_1976 omitted)

Linear regression                               Number of obs     =      1,938
                                                F(88, 1849)       =     145.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8855
                                                Root MSE          =     103.13

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.03513   2.077279    -4.83   0.000    -14.10918   -5.961068
    _Ifips_2 |   102.5407   17.33881     5.91   0.000     68.53504    136.5465
    _Ifips_4 |   40.23205   12.61186     3.19   0.001     15.49707    64.96703
    _Ifips_5 |  -61.99869   17.41258    -3.56   0.000    -96.14906   -27.84831
    _Ifips_6 |   229.5512   26.90906     8.53   0.000     176.7758    282.3265
    _Ifips_8 |  -96.35986   16.08163    -5.99   0.000    -127.8999   -64.81979
    _Ifips_9 |  -156.1458   13.19508   -11.83   0.000    -182.0246    -130.267
   _Ifips_10 |   57.25325   21.69493     2.64   0.008     14.70411    99.80239
   _Ifips_11 |   1297.725    69.2728    18.73   0.000     1161.864    1433.586
   _Ifips_12 |   346.9249   27.19183    12.76   0.000      293.595    400.2548
   _Ifips_13 |   13.72396   14.06599     0.98   0.329    -13.86292    41.31084
   _Ifips_15 |  -272.5244   16.56189   -16.45   0.000    -305.0064   -240.0424
   _Ifips_16 |  -267.9251   14.16611   -18.91   0.000    -295.7083   -240.1418
   _Ifips_17 |   197.3026   21.77828     9.06   0.000       154.59    240.0152
   _Ifips_18 |  -143.0498   12.91077   -11.08   0.000     -168.371   -117.7286
   _Ifips_19 |  -279.5925   16.40216   -17.05   0.000    -311.7612   -247.4238
   _Ifips_20 |  -145.8446   15.10057    -9.66   0.000    -175.4606   -116.2287
   _Ifips_21 |  -207.4415   12.38786   -16.75   0.000    -231.7371   -183.1458
   _Ifips_22 |   207.3354   18.41186    11.26   0.000     171.2251    243.4456
   _Ifips_23 |  -380.6098   17.68234   -21.52   0.000    -415.2893   -345.9304
   _Ifips_24 |   240.5857   18.22421    13.20   0.000     204.8435    276.3279
   _Ifips_25 |   26.30344   14.24529     1.85   0.065    -1.635094    54.24198
   _Ifips_26 |   126.1288   17.49771     7.21   0.000     91.81145    160.4461
   _Ifips_27 |  -263.0089   14.36488   -18.31   0.000    -291.1819   -234.8358
   _Ifips_28 |  -171.3318   12.94008   -13.24   0.000    -196.7105   -145.9531
   _Ifips_29 |   26.13222   12.80332     2.04   0.041     1.021741    51.24271
   _Ifips_30 |  -288.2807   23.40743   -12.32   0.000    -334.1884   -242.3729
   _Ifips_31 |  -251.6959   18.03148   -13.96   0.000    -287.0601   -216.3317
   _Ifips_32 |    194.787   20.08727     9.70   0.000     155.3909    234.1831
   _Ifips_33 |  -394.2183   18.94537   -20.81   0.000    -431.3749   -357.0617
   _Ifips_34 |   -48.8486   16.35471    -2.99   0.003    -80.92424   -16.77297
   _Ifips_35 |   193.2463    16.8041    11.50   0.000     160.2893    226.2033
   _Ifips_36 |   238.4535    40.2905     5.92   0.000     159.4338    317.4731
   _Ifips_37 |   -35.5044   13.05575    -2.72   0.007    -61.10995   -9.898845
   _Ifips_38 |  -436.4184   22.08929   -19.76   0.000     -479.741   -393.0958
   _Ifips_39 |  -110.7973   13.23288    -8.37   0.000    -136.7502   -84.84434
   _Ifips_40 |  -42.88711   15.58994    -2.75   0.006    -73.46285   -12.31137
   _Ifips_41 |  -93.72978   17.98306    -5.21   0.000     -128.999   -58.46055
   _Ifips_42 |   -131.071   14.32666    -9.15   0.000    -159.1691   -102.9729
   _Ifips_44 |  -188.8947    13.7192   -13.77   0.000    -215.8014   -161.9879
   _Ifips_45 |   249.0714   19.37992    12.85   0.000     211.0625    287.0802
   _Ifips_46 |  -360.9209   20.83168   -17.33   0.000     -401.777   -320.0648
   _Ifips_47 |   99.21211   23.91685     4.15   0.000     52.30525     146.119
   _Ifips_48 |    44.0536    15.4826     2.85   0.004     13.68838    74.41883
   _Ifips_49 |  -272.1293   14.45363   -18.83   0.000    -300.4764   -243.7821
   _Ifips_50 |  -404.1123   17.78579   -22.72   0.000    -438.9947     -369.23
   _Ifips_51 |  -237.8344   13.60552   -17.48   0.000    -264.5182   -211.1506
   _Ifips_53 |  -106.9003   12.28278    -8.70   0.000    -130.9899   -82.81071
   _Ifips_54 |  -275.2218    19.2248   -14.32   0.000    -312.9263   -237.5172
   _Ifips_55 |  -292.7112   16.57109   -17.66   0.000    -325.2113   -260.2112
   _Ifips_56 |  -265.6755   15.39148   -17.26   0.000     -295.862    -235.489
 _Iyear_1977 |     4.1178   17.46864     0.24   0.814    -30.14253    38.37813
 _Iyear_1978 |   14.00679   17.52539     0.80   0.424    -20.36484    48.37842
 _Iyear_1979 |   55.35388   16.55561     3.34   0.001     22.88422    87.82354
 _Iyear_1980 |   98.61733   17.91379     5.51   0.000     63.48395    133.7507
 _Iyear_1981 |   107.6583   20.05473     5.37   0.000     68.32598    146.9906
 _Iyear_1982 |   107.8664    17.7935     6.06   0.000     72.96893    142.7639
 _Iyear_1983 |   76.45244   16.45896     4.65   0.000     44.17234    108.7325
 _Iyear_1984 |   56.93833   15.31538     3.72   0.000     26.90106    86.97559
 _Iyear_1985 |   66.34162   15.51448     4.28   0.000     35.91389    96.76936
 _Iyear_1986 |   93.66879   17.63449     5.31   0.000     59.08319    128.2544
 _Iyear_1987 |   75.13653   16.74906     4.49   0.000     42.28747    107.9856
 _Iyear_1988 |     94.589   17.13793     5.52   0.000     60.97728    128.2007
 _Iyear_1989 |   112.0718   18.58901     6.03   0.000     75.61409    148.5294
 _Iyear_1990 |   171.3197   22.52865     7.60   0.000     127.1354     215.504
 _Iyear_1991 |   205.0795   22.78004     9.00   0.000     160.4022    249.7568
 _Iyear_1992 |   220.6049   27.16948     8.12   0.000     167.3188     273.891
 _Iyear_1993 |   222.2735   27.84156     7.98   0.000     167.6693    276.8777
 _Iyear_1994 |   195.6774   23.60904     8.29   0.000     149.3742    241.9806
 _Iyear_1995 |    178.672   23.95584     7.46   0.000     131.6886    225.6553
 _Iyear_1996 |   140.9861   20.85858     6.76   0.000     100.0772    181.8949
 _Iyear_1997 |   118.1068   16.69917     7.07   0.000     85.35557     150.858
 _Iyear_1998 |   81.38493   16.27022     5.00   0.000       49.475    113.2949
 _Iyear_1999 |   44.76982   16.57276     2.70   0.007     12.26654     77.2731
 _Iyear_2000 |   27.52688   17.12442     1.61   0.108    -6.058355    61.11212
 _Iyear_2001 |   33.94871   16.13391     2.10   0.035      2.30612    65.59131
 _Iyear_2002 |   36.42673   15.55238     2.34   0.019     5.924664     66.9288
 _Iyear_2003 |   28.84879   16.12666     1.79   0.074    -2.779588    60.47717
 _Iyear_2004 |   13.68479   18.15884     0.75   0.451    -21.92919    49.29877
 _Iyear_2005 |   15.17467   18.45894     0.82   0.411     -21.0279    51.37723
 _Iyear_2006 |   32.87152   18.89404     1.74   0.082    -4.184385    69.92742
 _Iyear_2007 |   26.61764   19.84653     1.34   0.180    -12.30631     65.5416
 _Iyear_2008 |   26.55425    19.1205     1.39   0.165    -10.94579    64.05429
 _Iyear_2009 |   36.75661   20.09531     1.83   0.068    -2.655283     76.1685
 _Iyear_2010 |   18.17774   20.76256     0.88   0.381     -22.5428    58.89827
 _Iyear_2011 |  -2.231504   21.75175    -0.10   0.918    -44.89207    40.42906
 _Iyear_2012 |  -8.286849    22.0603    -0.38   0.707    -51.55257    34.97888
 _Iyear_2013 |  -16.78061    22.0609    -0.76   0.447     -60.0475    26.48627
       _cons |    509.001   23.58685    21.58   0.000     462.7414    555.2607
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, N, Year FE, Y) cttop(xi)
econ108_32_lab4.xml
dir : seeout

. 
. *D areg
. areg violentrate uerate, absorb(fips) robust

Linear regression, absorbing indicators         Number of obs     =      1,938
Absorbed variable: fips                         No. of categories =         51
                                                F(   1,   1886)   =      61.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8354
                                                Adj R-squared     =     0.8309
                                                Root MSE          =   122.4379

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.91749   1.387807    -7.87   0.000    -13.63929   -8.195695
       _cons |   534.4038   8.556269    62.46   0.000      517.623    551.1845
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, N) cttop(areg)
econ108_32_lab4.xml
dir : seeout

. 
. areg violentrate uerate i.year, absorb(fips) robust

Linear regression, absorbing indicators         Number of obs     =      1,938
Absorbed variable: fips                         No. of categories =         51
                                                F(  38,   1849)   =      18.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8855
                                                Adj R-squared     =     0.8801
                                                Root MSE          =   103.1295

------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.03513   2.077279    -4.83   0.000    -14.10918   -5.961068
             |
        year |
       1977  |     4.1178   17.46864     0.24   0.814    -30.14253    38.37813
       1978  |   14.00679   17.52539     0.80   0.424    -20.36484    48.37842
       1979  |   55.35388   16.55561     3.34   0.001     22.88422    87.82354
       1980  |   98.61733   17.91379     5.51   0.000     63.48395    133.7507
       1981  |   107.6583   20.05473     5.37   0.000     68.32598    146.9906
       1982  |   107.8664    17.7935     6.06   0.000     72.96893    142.7639
       1983  |   76.45244   16.45896     4.65   0.000     44.17234    108.7325
       1984  |   56.93833   15.31538     3.72   0.000     26.90106    86.97559
       1985  |   66.34162   15.51448     4.28   0.000     35.91389    96.76936
       1986  |   93.66879   17.63449     5.31   0.000     59.08319    128.2544
       1987  |   75.13653   16.74906     4.49   0.000     42.28747    107.9856
       1988  |     94.589   17.13793     5.52   0.000     60.97728    128.2007
       1989  |   112.0718   18.58901     6.03   0.000     75.61409    148.5294
       1990  |   171.3197   22.52865     7.60   0.000     127.1354     215.504
       1991  |   205.0795   22.78004     9.00   0.000     160.4022    249.7568
       1992  |   220.6049   27.16948     8.12   0.000     167.3188     273.891
       1993  |   222.2735   27.84156     7.98   0.000     167.6693    276.8777
       1994  |   195.6774   23.60904     8.29   0.000     149.3742    241.9806
       1995  |    178.672   23.95584     7.46   0.000     131.6886    225.6553
       1996  |   140.9861   20.85858     6.76   0.000     100.0772    181.8949
       1997  |   118.1068   16.69917     7.07   0.000     85.35557     150.858
       1998  |   81.38493   16.27022     5.00   0.000       49.475    113.2949
       1999  |   44.76982   16.57276     2.70   0.007     12.26654     77.2731
       2000  |   27.52688   17.12442     1.61   0.108    -6.058355    61.11212
       2001  |   33.94871   16.13391     2.10   0.035      2.30612    65.59131
       2002  |   36.42673   15.55238     2.34   0.019     5.924664     66.9288
       2003  |   28.84879   16.12666     1.79   0.074    -2.779588    60.47717
       2004  |   13.68479   18.15884     0.75   0.451    -21.92919    49.29877
       2005  |   15.17467   18.45894     0.82   0.411     -21.0279    51.37723
       2006  |   32.87152   18.89404     1.74   0.082    -4.184385    69.92742
       2007  |   26.61764   19.84653     1.34   0.180    -12.30631     65.5416
       2008  |   26.55425    19.1205     1.39   0.165    -10.94579    64.05429
       2009  |   36.75661   20.09531     1.83   0.068    -2.655283     76.1685
       2010  |   18.17774   20.76256     0.88   0.381     -22.5428    58.89827
       2011  |  -2.231504   21.75175    -0.10   0.918    -44.89207    40.42906
       2012  |  -8.286849    22.0603    -0.38   0.707    -51.55257    34.97888
       2013  |  -16.78061    22.0609    -0.76   0.447     -60.0475    26.48627
             |
       _cons |   455.0182   18.59427    24.47   0.000     418.5503    491.4862
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, Y) cttop(areg)
econ108_32_lab4.xml
dir : seeout

. 
. *E-F .xtreg
. xtset fips year
       panel variable:  fips (strongly balanced)
        time variable:  year, 1976 to 2013
                delta:  1 unit

. 
. xtreg violentrate uerate, fe robust

Fixed-effects (within) regression               Number of obs     =      1,938
Group variable: fips                            Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.0248                                         min =         38
     between = 0.2341                                         avg =       38.0
     overall = 0.0340                                         max =         38

                                                F(1,50)           =      31.21
corr(u_i, Xb)  = -0.2801                        Prob > F          =     0.0000

                                  (Std. Err. adjusted for 51 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.91749   1.954303    -5.59   0.000    -14.84283   -6.992161
       _cons |   534.4038    11.9874    44.58   0.000     510.3264    558.4812
-------------+----------------------------------------------------------------
     sigma_u |  280.39427
     sigma_e |  122.43792
         rho |  .83985979   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, N) cttop(xtreg)
econ108_32_lab4.xml
dir : seeout

. 
. xtreg violentrate uerate i.year, fe robust

Fixed-effects (within) regression               Number of obs     =      1,938
Group variable: fips                            Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.3217                                         min =         38
     between = 0.2341                                         avg =       38.0
     overall = 0.0251                                         max =         38

                                                F(38,50)          =      25.64
corr(u_i, Xb)  = -0.0834                        Prob > F          =     0.0000

                                  (Std. Err. adjusted for 51 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
 violentrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      uerate |  -10.03513   3.962431    -2.53   0.015     -17.9939   -2.076349
             |
        year |
       1977  |     4.1178   4.975531     0.83   0.412    -5.875848    14.11145
       1978  |   14.00679   8.063635     1.74   0.089    -2.189498    30.20308
       1979  |   55.35388   11.16021     4.96   0.000     32.93794    77.76981
       1980  |   98.61733   13.82507     7.13   0.000     70.84885    126.3858
       1981  |   107.6583   17.35877     6.20   0.000     72.79217    142.5244
       1982  |   107.8664   14.35498     7.51   0.000     79.03358    136.6992
       1983  |   76.45244   12.02072     6.36   0.000     52.30812    100.5968
       1984  |   56.93833   9.308032     6.12   0.000      38.2426    75.63406
       1985  |   66.34162    9.86221     6.73   0.000     46.53279    86.15045
       1986  |   93.66879   13.59615     6.89   0.000     66.36012    120.9775
       1987  |   75.13653   13.67639     5.49   0.000      47.6667    102.6064
       1988  |     94.589   18.01929     5.25   0.000     58.39618    130.7818
       1989  |   112.0718   22.72182     4.93   0.000     66.43363    157.7099
       1990  |   171.3197   28.58661     5.99   0.000     113.9018    228.7376
       1991  |   205.0795   27.45507     7.47   0.000     149.9344    260.2246
       1992  |   220.6049   31.91357     6.91   0.000     156.5046    284.7052
       1993  |   222.2735   33.94398     6.55   0.000      154.095     290.452
       1994  |   195.6774   30.37547     6.44   0.000     134.6665    256.6883
       1995  |    178.672   31.46319     5.68   0.000     115.4763    241.8676
       1996  |   140.9861   28.97238     4.87   0.000     82.79336    199.1788
       1997  |   118.1068   24.94092     4.74   0.000     68.01148    168.2021
       1998  |   81.38493   22.85377     3.56   0.001     35.48179    127.2881
       1999  |   44.76982    21.8591     2.05   0.046     .8645294    88.67511
       2000  |   27.52688    20.9482     1.31   0.195    -14.54882    69.60258
       2001  |   33.94871   20.46028     1.66   0.103    -7.146961    75.04439
       2002  |   36.42673   18.99005     1.92   0.061    -1.715909    74.56937
       2003  |   28.84879   18.88465     1.53   0.133    -9.082142    66.77972
       2004  |   13.68479   19.24854     0.71   0.480    -24.97704    52.34662
       2005  |   15.17467   20.04116     0.76   0.452    -25.07919    55.42853
       2006  |   32.87152   22.02887     1.49   0.142    -11.37477    77.11781
       2007  |   26.61764    22.5802     1.18   0.244    -18.73601     71.9713
       2008  |   26.55425   20.53208     1.29   0.202    -14.68565    67.79415
       2009  |   36.75661   20.36674     1.80   0.077    -4.151192    77.66441
       2010  |   18.17774   20.35196     0.89   0.376    -22.70037    59.05584
       2011  |  -2.231504   20.50417    -0.11   0.914    -43.41534    38.95234
       2012  |  -8.286849   19.65097    -0.42   0.675    -47.75698    31.18328
       2013  |  -16.78061   19.21832    -0.87   0.387    -55.38174    21.82051
             |
       _cons |   455.0182   32.93886    13.81   0.000     388.8586    521.1779
-------------+----------------------------------------------------------------
     sigma_u |  279.87218
     sigma_e |  103.12951
         rho |  .88044963   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using econ108_32_lab4, excel keep(uerate) addtext(State FE, Y, Year FE, Y) cttop(xtreg)
econ108_32_lab4.xml
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  C:\ECON108\Lab4\econ108_32_lab4.log
  log type:  text
 closed on:  13 May 2022, 14:39:16
-----------------------------------------------------------------------------------------------------------------------------------------------------
